# Menggabungkan Data dengan Bentuk SQL Query

In [1]:
import pandas as pd
pd.__version__

'2.2.2'

Topi bahasan: 
- Left Join
- Right Join
- Inner Join
- Outer Join

In [2]:
data = {
    'emp_id' : ['1','2','3','4','5'],
    'first_name' : ['Jason', 'Andy', 'Allen', 'John', 'Amy'],
    'last_name' : ['Larkin', 'Jacob', 'A', 'Snow', 'Jackson']
}

df1 = pd.DataFrame(data, columns=['emp_id', 'first_name', 'last_name'])
df1

  emp_id first_name last_name
0      1      Jason    Larkin
1      2       Andy     Jacob
2      3      Allen         A
3      4       John      Snow
4      5        Amy   Jackson

In [3]:
data = {
    'emp_id' : ['4','5','6','7'],
    'first_name' : ['James', 'Shize', 'Kim', 'Jose'],
    'last_name' : ['Alexander', 'Suma', 'Shoe', 'Murinho']
}

df2 = pd.DataFrame(data, columns=['emp_id', 'first_name', 'last_name'])
df2

  emp_id first_name  last_name
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Shoe
3      7       Jose    Murinho

### Left Join

Left join menghasilkan tabel output yang berisi kumpulan record lengkap dari Tabel A, dan hanya record yang cocok di Tabel B. Jika tidak ada ke cocokan, sisi kanan akan bernilai null.

Catatan : perhatikan bahwa kita dapat menambahkan sufiks untuk menghindari duplikat, jika tidak disediakan maka secara otomatis menambahkan x ke Tabel A dan y ke Tabel B.

In [4]:
# left join
print(pd.merge(df1, df2, on='emp_id', how='left'))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      1        Jason      Larkin          NaN         NaN
1      2         Andy       Jacob          NaN         NaN
2      3        Allen           A          NaN         NaN
3      4         John        Snow        James   Alexander
4      5          Amy     Jackson        Shize        Suma

In [ ]:
print(pd.merge(df1, df2, on='emp_id', how='left', suffixe))